var a =  String('颜值达人\n' +
    '剧情搞笑\n' +
    '美妆\n' +
    '美妆教程\n' +
    '妆容展示\n' +
    '护肤保养\n' +
    '美妆测评种草\n' +
    '时尚\n' +
    '穿搭\n' +
    '街拍\n' +
    '造型\n' +
    '萌宠\n' +
    '音乐\n' +
    '舞蹈\n' +
    '美食\n' +
    '美食教程\n' +
    '美食探店\n' +
    '吃播大胃王\n' +
    '美食产品测评\n' +
    '乡村野食\n' +
    '美食其他\n' +
    '游戏\n' +
    '旅行\n' +
    '汽车\n' +
    '生活\n' +
    '测评\n' +
    '美妆测评\n' +
    '3C数码测评\n' +
    '汽车测评\n' +
    '美食产品测评\n' +
    '母婴产品测评\n' +
    '综合测评\n' +
    '二次元\n' +
    '母婴亲子\n' +
    '科技数码\n' +
    '教育培训\n' +
    '运动健身\n' +
    '家居家装\n' +
    '才艺技能\n' +
    '影视娱乐\n' +
    '艺术文化\n' +
    '财经投资\n' +
    '情感\n' +
    '三农\n' +
    '园艺');
var b = a.split("\n");
console.log(b);